# Konversi nilai numerik ke dalam sejumlah kategori

# import modul

In [2]:
import pandas as pd
import numpy as np

# Persiapan Data Frame
- Data frame terdiri dari 10 Baris dan 1 Kolom colom nya adalah 'usia'
- Nilai usia bersifat random
- Jangkauan usia random dari 1-99

In [4]:
n_rows = 10 
n_cols = 1 
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)),
                 columns=cols)
df

   usia
0    92
1    47
2    57
3    97
4    73
5    49
6    49
7    78
8    15
9     7

# Membuat kolom pengelompokan usia menggunakan Metode cut()
- Pengelompokan yang akan di buat terdiri dari kelompok 'anak'(0-18),(18-65)'dewasa',(65-99) 'manula'
- konversi nilai numerik kedalam beberapa kategori = pd.cut()
- pemotongan pengelompokan menggunakan 'bins'
- 'labels' lebel untuk setiao kelompok usia

In [5]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins = [0, 18, 65, 99],
                            labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    92        manula
1    47        dewasa
2    57        dewasa
3    97        manula
4    73        manula
5    49        dewasa
6    49        dewasa
7    78        manula
8    15          anak
9     7          anak

#  Menggabungkan dua Pandas data frame

# Persiapan Data Frame
- Data frame terdiri dari 5 baris dan 5 kolom
- Setiap koloms diberi nama 'A', 'B', 'C', 'D', 'E'
- Setiap nilai merupakan nilai acak yang jangkauan nya dari 1-20

In [7]:
n_rows = 5 
n_cols = 5 
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  19  19  11  14   3
1  15   4   9  19   8
2  19   2  12   6  11
3   2  15   5  19   3
4   6   6   7   6  19

# Potongan Data Frame #1

In [8]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0  19  19  11  14   3
2  19   2  12   6  11
3   2  15   5  19   3

# Potongan Data Frame #2

In [9]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A  B   C   D   E
1  15  4   9  19   8
2  19  2  12   6  11
4   6  6   7   6  19

# Inner merge
- Membuat Data frame baru yang isi nya adalah gabungan dari df1 dan df2 yang nilai barisnya sama

In [10]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B   C  D   E
0  19  2  12  6  11

# Outer merge
- Menggabungkan df1 dan df2 dimana baris yang memiliki nilai nya sama akan di gabungkan menjadi 1

In [11]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0  19  19  11  14   3
1  19   2  12   6  11
2   2  15   5  19   3
3  15   4   9  19   8
4   6   6   7   6  19

# Memecah nilai String ke dalam beberapa kolom Data Frame

# Persiapan Data Frame
- Terdapat 2 buah kolom yaitu kolom nama dan kolom tempat_kelahiran

In [18]:
data = {'nama':['Christian Ronaldo', 'Luis Suarez', 'Robert Lewandowski'],
       'club_negara':['Manchaster United, England', 'Atletico Madrid, Spain', 'Bayern Munich, Germain']}
df = pd.DataFrame(data)
df

                 nama                 club_negara
0   Christian Ronaldo  Manchaster United, England
1         Luis Suarez      Atletico Madrid, Spain
2  Robert Lewandowski      Bayern Munich, Germain

# Memisahkan nama depan dan belakang
- String spliting memisah kan nama depan dan belakang berdasarkan ' ' (spasi)

In [19]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

                 nama                 club_negara nama_depan nama_belakang
0   Christian Ronaldo  Manchaster United, England  Christian       Ronaldo
1         Luis Suarez      Atletico Madrid, Spain       Luis        Suarez
2  Robert Lewandowski      Bayern Munich, Germain     Robert   Lewandowski

# Memisahkan club dan negara 
- String spliting memisah kan club dan negara berdasarkan ',' (koma)

In [20]:
df[['club', 'negara']] = df['club_negara'].str.split(',', expand=True)
df

,nama,club_negara,nama_depan,nama_belakang,club,negara
0,Christian Ronaldo,"Manchaster United, England",Christian,Ronaldo,Manchaster United,England
1,Luis Suarez,"Atletico Madrid, Spain",Luis,Suarez,Atletico Madrid,Spain
2,Robert Lewandowski,"Bayern Munich, Germain",Robert,Lewandowski,Bayern Munich,Germain